uhnp/src/Documents/ОплатаМСФО/ОплатаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаМСФО</name>
  <basedOn>Document.РеализацияМСФО</basedOn>
  <basedOn>Document.ПоступлениеМСФО</basedOn>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОплатМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаДС</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНалоговМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыУчетаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/УчетныеПолитикиМСФО/УчетныеПолитикиМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеПолитикиМСФО</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Catalogs/ВидыОплатМСФО/ВидыОплатМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатМСФО</name>
  <predefined>
    <items>
      <name>ВыдачаЗаймаКонтрагенту</name>
      <description>Выдача займа контрагенту</description>
    </items>
    <items>
      <name>ОплатаПокупателя</name>
      <description>Оплата покупателя</description>
    </items>
    <items>
      <name>ОплатаПоставщику</name>
      <description>Оплата поставщику</description>
    </items>
    <items>
      <name>ПереводСДругогоСчета</name>
      <description>Перевод с другого счета</description>
    </items>
    <items>
      <name>ПеречислениеЗП</name>
      <description>Перечисление заработной платы</description>
    </items>
    <items>
      <name>ПеречислениеНалога</name>
      <description>Перечисление налога</description>
    </items>
    <items>
      <name>ПолучениеЗайма</name>
      <description>Получение займа</description>
    </items>
    <items>
      <name>ПриобретениеИностраннойВалюты</name>
      <description>Приобретение иностранной валюты</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКосвенныеНалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьПараметровУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщенияISO</name>
    <type>
      <types>EnumRef.ВидыСообщенийISO20022</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/СчетаБД/СчетаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетаБД</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПланыСчетовБД</owners>
  <attributes>
    <name>Забалансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетСсылка</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРаздел</name>
    <type>
      <types>EnumRef.РазделПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_АктивОбязательство</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКурсовыхРазниц</name>
    <type>
      <types>EnumRef.СпособыРасчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппирующийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтложенногоНалога</name>
    <type>
      <types>CatalogRef.ВидыВременныхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляИсключенийПриТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйИнструмент</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьВидыДвижений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПланаСчетов</name>
    <type>
      <types>CatalogRef.РазделыПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетаУчетаКурсовыхРазниц</name>
    <type>
      <types>CatalogRef.СчетаУчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВФВ</name>
    <type>
      <types>EnumRef.ПересчетыВФВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияКорреспонденцииСчета</name>
    <type>
      <types>EnumRef.СпособыДетализацииКорреспонденцииСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыСубконто</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОбороты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоСальдо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакиУчетаСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконтоСсылка</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Documents/ОплатаМСФО/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИтогиВключены = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОплатаМСФО", "ИтогиВключены", Истина);

	Если ИтогиВключены Тогда
		Элементы.ГруппаИтоги.Видимость = Истина;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СформироватьПараметрыИтогов(ЭтотОбъект));
	Иначе
		Элементы.ГруппаИтоги.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СписокЗагрузить.Видимость = Не ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ();//нет в ЕРПУХ
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИтогиВключены Тогда
		ВсегдаОбновлять = Истина;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти                   

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПоказатьСкрытьИтоги(Команда)
	
	ИтогиВключены = НЕ ИтогиВключены;
	Элементы.ГруппаИтоги.Видимость = ИтогиВключены;
	Если ИтогиВключены тогда
		ВсегдаОбновлять = Истина;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ОплатаМСФО", "ИтогиВключены", ИтогиВключены);
	
КонецПроцедуры

&НаКлиенте
Процедура Поступление(Команда)
	
	СтруктураОтбора = ОбщегоНазначенияУХВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	Если СтруктураОтбора.Свойство("ДатаОтбора") Тогда
		СтруктураОтбора.Вставить("Дата", СтруктураОтбора.ДатаОтбора);
	КонецЕсли;
	
	Если Не СтруктураОтбора.Свойство("ВидОперации") Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОплатМСФО.ОплатаПокупателя");
		СтруктураОтбора.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ОплатаМСФО.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура Списание(Команда)
	
	СтруктураОтбора = ОбщегоНазначенияУХВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	Если СтруктураОтбора.Свойство("ДатаОтбора") Тогда
		СтруктураОтбора.Вставить("Дата", СтруктураОтбора.ДатаОтбора);
	КонецЕсли;
	
	Если Не СтруктураОтбора.Свойство("ВидОперации") Тогда
		ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОплатМСФО.ОплатаПоставщику");
		СтруктураОтбора.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ОплатаМСФО.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", СтруктураОтбора), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ИтогиВключены Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОтбораИспользованиеПриИзменении(Элемент)
	
	УстановитьБыстрыйОтбор(ЭтотОбъект, "ДатаОтбора");
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОтбораПриИзменении(Элемент)
	
	ОтборДатаОтбораИспользование = ЗначениеЗаполнено(ОтборДатаОтбора);
	УстановитьБыстрыйОтбор(ЭтотОбъект, "ДатаОтбора");
	
	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанковскийСчетИспользованиеПриИзменении(Элемент)

	УстановитьБыстрыйОтбор(ЭтотОбъект, "СчетОрганизации");
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОтборБанковскийСчетПриИзменении(Элемент)
	
	ОтборДатаОтбораИспользование = ЗначениеЗаполнено(ОтборДатаОтбора);
	УстановитьБыстрыйОтбор(ЭтотОбъект, "СчетОрганизации");
	
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборДатаОтбораИспользование = ЗначениеЗаполнено(ОтборДатаОтбора);
	УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	ПересчитатьИтоги();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Итоги

&НаКлиенте
// Обновление сумм остатков и оборотов за день в форме журнала
//
Процедура ОбновитьИтоги()
	
	Если НЕ ИтогиВключены Тогда
		ВсегдаОбновлять = Ложь;
		Возврат;
	КонецЕсли;
	
	НастройкиСКД = Неопределено;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		
		НастройкиСКД = Список.КомпоновщикНастроек.Настройки;
	
		ТекСценарий		  = ЗначениеОтбора(НастройкиСКД, "Сценарий");
		ТекОрганизация    = ЗначениеОтбора(НастройкиСКД, "Организация");
		ТекБанковскийСчет = ЗначениеОтбора(НастройкиСКД, "СчетОрганизации");
		ТекДата			  = ЗначениеОтбора(НастройкиСКД, "Дата");
		
		Если Не ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата       = ТекущаяДата();
		КонецЕсли;
		
	ИначеЕсли НЕ ТекДанные.Свойство("Ссылка") Тогда
		ВсегдаОбновлять = Ложь;
		Возврат;
	Иначе
		
		ТекДата           = ТекДанные.Дата;
		ТекОрганизация    = ТекДанные.Организация;
		ТекБанковскийСчет = ТекДанные.СчетОрганизации;
		ТекСценарий 	  = ТекДанные.Сценарий;
		
		Если НЕ ЗначениеЗаполнено(ТекБанковскийСчет) И НЕ ИспользоватьНесколькоБанковскихСчетовОрганизации Тогда
			
			НастройкиСКД = Список.КомпоновщикНастроек.Настройки;
	        ТекБанковскийСчет = ЗначениеОтбора(НастройкиСКД, "СчетОрганизации");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВсегдаОбновлять ИЛИ НачалоДня(ИтогиДата) <> НачалоДня(ТекДата) ИЛИ ИтогиБанковскийСчет <> ТекБанковскийСчет Тогда
		
		СтруктураПараметров = Новый Структура("ТекДата, ТекОрганизация, ТекБанковскийСчет, ТекСценарий",
			ТекДата, ТекОрганизация, ТекБанковскийСчет, ТекСценарий);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СформироватьПараметрыИтогов(ЭтотОбъект, СтруктураПараметров));
		
	КонецЕсли;
	
	ВсегдаОбновлять = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПараметрыИтогов(Форма, СтруктураПараметров = Неопределено)

	НастройкиСКД = Форма.Список.КомпоновщикНастроек.Настройки;
	
	Если СтруктураПараметров = Неопределено Тогда
		
		ТекОрганизация    	= ЗначениеОтбора(НастройкиСКД, "Организация");
		ТекБанковскийСчет 	= ЗначениеОтбора(НастройкиСКД, "СчетОрганизации");
		ТекСценарий 		= ЗначениеОтбора(НастройкиСКД, "Сценарий");
		ТекДата 			= ЗначениеОтбора(НастройкиСКД, "Дата");
		
		Если Не ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата = ТекущаяДата();
		КонецЕсли;
			
	Иначе
		
		ТекДата           = СтруктураПараметров.ТекДата;
		ТекОрганизация    = СтруктураПараметров.ТекОрганизация;
		ТекБанковскийСчет = СтруктураПараметров.ТекБанковскийСчет;
		ТекСценарий 	  = СтруктураПараметров.ТекСценарий;
		
	КонецЕсли;
	
	СтруктураИтогов = ПолучитьИтоги(ТекДата, ТекОрганизация, ТекБанковскийСчет, ТекСценарий);
	
	Возврат Новый Структура(
		"ИтогиБанковскийСчет, ИтогиДата, ДатаИтогов, ИтогиНаНачалоДня, ИтогиНаКонецДня,
		|ИтогиПоступило, ИтогиСписано",
			ТекБанковскийСчет,
			ТекДата, Формат(ТекДата, "ДЛФ=D"),
			СтруктураИтогов.НачальныйОстаток,
			СтруктураИтогов.КонечныйОстаток,
			СтруктураИтогов.ВсегоПоступило,
			СтруктураИтогов.ВсегоСписано);
	
КонецФункции

&НаСервереБезКонтекста
// Возвращает таблицу сумм остатков и оборотов за указанный день по указанному счету
//
Функция ПолучитьИтоги(Знач ТекДата, Знач ТекОрганизация, Знач ТекБанковскийСчет, Знач ТекСценарий)
	
	СтруктураРезультат = Новый Структура("НаименованиеСчета,
		|НачальныйОстаток, ВсегоПоступило, ВсегоСписано, КонечныйОстаток"
		, ""
		, 0, 0, 0, 0);

	Если УчетМСФОПовтИспУХ.ЕстьРСБУ() Тогда
		МодульРСБУ = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБПВызовСервераПовтИсп");
		СписокДоступныхОрганизаций = МодульРСБУ.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	Иначе 
		СписокДоступныхОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекОрганизация);
	
	КонецЕсли;
	
	// Если нет доступных организаций, то Итоги не вычисляем
	Если СписокДоступныхОрганизаций.Количество() = 0 Тогда
		Возврат СтруктураРезультат;
	ИначеЕсли ЗначениеЗаполнено(ТекОрганизация) Тогда
		// Если организация не числится в списке доступных, то Итоги не вычисляем
		Если СписокДоступныхОрганизаций.Найти(ТекОрганизация) = Неопределено Тогда
			Возврат СтруктураРезультат;
		КонецЕсли;
	КонецЕсли;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.УчетнаяПолитика.ПланСчетовУчета КАК ПланСчетовМСФО
	|ПОМЕСТИТЬ втПланыСчетовМСФО
	|ИЗ
	|	РегистрСведений.УчетныеПолитикиМСФО.СрезПоследних(
	|			&ДатаИтоговКонецДня,
	|			Сценарий = &Сценарий
	|				И Организация В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), &Организации)) КАК т
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.СчетСсылка КАК СчетСсылка
	|ПОМЕСТИТЬ втСчетаДДС
	|ИЗ
	|	Справочник.СчетаБД КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПланыСчетовМСФО КАК втПланыСчетовМСФО
	|		ПО т.Владелец = втПланыСчетовМСФО.ПланСчетовМСФО
	|ГДЕ
	|	т.РазделПланаСчетов = ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.ДенежныеСредства)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_БИ.ЭтоВалютныйСчет
	|					ТОГДА ВТ_БИ.ВалютнаяСуммаНачальныйОстаток
	|				ИНАЧЕ ВТ_БИ.СуммаНачальныйОстаток
	|			КОНЕЦ), 0) КАК НачальныйОстаток,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_БИ.ЭтоВалютныйСчет
	|					ТОГДА ВТ_БИ.ВалютнаяСуммаОборотДт
	|				ИНАЧЕ ВТ_БИ.СуммаОборотДт
	|			КОНЕЦ), 0) КАК ВсегоПоступило,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_БИ.ЭтоВалютныйСчет
	|					ТОГДА ВТ_БИ.ВалютнаяСуммаОборотКт
	|				ИНАЧЕ ВТ_БИ.СуммаОборотКт
	|			КОНЕЦ), 0) КАК ВсегоСписано,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_БИ.ЭтоВалютныйСчет
	|					ТОГДА ВТ_БИ.ВалютнаяСуммаКонечныйОстаток
	|				ИНАЧЕ ВТ_БИ.СуммаКонечныйОстаток
	|			КОНЕЦ), 0) КАК КонечныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		БИ.СуммаВВалютеУчетаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		БИ.СуммаВВалютеНачальныйОстаток КАК ВалютнаяСуммаНачальныйОстаток,
	|		БИ.СуммаВВалютеУчетаОборотДт КАК СуммаОборотДт,
	|		БИ.СуммаВВалютеОборотДт КАК ВалютнаяСуммаОборотДт,
	|		БИ.СуммаВВалютеУчетаОборотКт КАК СуммаОборотКт,
	|		БИ.СуммаВВалютеОборотКт КАК ВалютнаяСуммаОборотКт,
	|		БИ.СуммаВВалютеУчетаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		БИ.СуммаВВалютеКонечныйОстаток КАК ВалютнаяСуммаКонечныйОстаток,
	|		ВЫБОР
	|			КОГДА БИ.СуммаВВалютеНачальныйОстаток <> 0
	|					ИЛИ БИ.СуммаВВалютеОборотДт <> 0
	|					ИЛИ БИ.СуммаВВалютеОборотКт <> 0
	|					ИЛИ БИ.СуммаВВалютеКонечныйОстаток <> 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоВалютныйСчет
	|	ИЗ
	|		РегистрБухгалтерии.МСФО.ОстаткиИОбороты(
	|				&ДатаИтоговНачалоДня,
	|				&ДатаИтоговКонецДня,
	|				,
	|				ДвиженияИГраницыПериода,
	|				Счет В
	|					(ВЫБРАТЬ
	|						т.СчетСсылка
	|					ИЗ
	|						втСчетаДДС КАК т),
	|				,
	|				Организация В (&Организации) {(&БСчет) КАК БанковскийСчетИтогов}) КАК БИ) КАК ВТ_БИ";
	
	ИмяБСчет = "БанковскиеСчета";
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		ИмяБСчет = "БанковскиеСчетаОрганизаций";
	КонецЕсли;
	Шаблон = СтрШаблон("ВЫРАЗИТЬ(Субконто1 КАК Справочник.%1)", ИмяБСчет);
    ПостроительЗапроса.Текст = СтрЗаменить(ПостроительЗапроса.Текст, "&БСчет", Шаблон);
	
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		СписокОрганизаций = Новый Массив;
		СписокОрганизаций.Добавить(ТекОрганизация);
	Иначе
		СписокОрганизаций = СписокДоступныхОрганизаций;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекБанковскийСчет) Тогда
		ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("БанковскийСчетИтогов");
		ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Значение      = ТекБанковскийСчет;
		СтруктураРезультат.НаименованиеСчета = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекБанковскийСчет, "Наименование"));
	КонецЕсли;
	
	ПостроительЗапроса.Параметры.Вставить("Сценарий",				ТекСценарий);
	ПостроительЗапроса.Параметры.Вставить("Организации",         	СписокОрганизаций);
	ПостроительЗапроса.Параметры.Вставить("ДатаИтоговНачалоДня", 	НачалоДня(ТекДата));
	ПостроительЗапроса.Параметры.Вставить("ДатаИтоговКонецДня",  	КонецДня(ТекДата));
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапроса = ПостроительЗапроса.ПолучитьЗапрос().Выполнить();
	
	Если НЕ РезультатыЗапроса.Пустой() Тогда
		Выборка = РезультатыЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, Выборка);
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьИтоги()
	
	// Вызовет пересчет итогов
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Если ИтогиВключены Тогда
			ВсегдаОбновлять = Ложь;
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИтогиОбработчик", 0.2, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьИтогиОбработчик()
	
	Если ИтогиВключены Тогда
		ОбновитьИтоги();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область БанкСчета

&НаСервере
Процедура УстановитьВидимостьБанковскогоСчета()
	
	ИспользоватьНесколькоБанковскихСчетовОрганизации    = ИспользуетсяНесколькоБанковскихСчетовОрганизации();
	
	Элементы.ОтборБанковскийСчет.Видимость              = ИспользоватьНесколькоБанковскихСчетовОрганизации;
	Элементы.ОтборБанковскийСчетИспользование.Видимость = ИспользоватьНесколькоБанковскихСчетовОрганизации;
	
КонецПроцедуры

&НаСервере
Функция ИспользуетсяНесколькоБанковскихСчетовОрганизации()
	
	ОтборОрганизация = Ложь;
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Возврат МСФОВстраиваниеУХВызовСервера.ИспользуетсяНесколькоБанковскихСчетовОрганизации(ОтборОрганизация);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеОтбора(ИсточникНастроек, ИмяПоля)
	
	Если ТипЗнч(ИсточникНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		НастройкиСКД = ИсточникНастроек.ПолучитьНастройки();
	Иначе 
		НастройкиСКД = ИсточникНастроек;
	КонецЕсли;
		
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиСКД.Отбор, ИмяПоля);
	Если ЭлементыОтбора.Количество() = 0 Или Не ЭлементыОтбора[0].Использование Тогда
		Возврат Неопределено;//отключен отбор
	КонецЕсли;
	
	Возврат ЭлементыОтбора[0].ПравоеЗначение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьБыстрыйОтбор(Форма, ИмяПоля, ВидСравнения = Неопределено) Экспорт
	
	ПравоеЗначение = Форма["Отбор" + ИмяПоля];
	Использование  = Форма["Отбор" + ИмяПоля + "Использование"];
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		Форма.Список.КомпоновщикНастроек.Настройки.Отбор, 
		ИмяПоля);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Список.КомпоновщикНастроек.Настройки.Отбор,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравнения,
		,
		Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		Возврат;//нет в ЕРПУХ
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Организация", ОтборОрганизация));
	ОткрытьФорму(Строка("Обработка.ЗагрузкаБанковскойВыпискиISO20022.Форма"), 
		ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти
